# Rebar Shape Terminations Data Methods

Source: https://www.revitapidocs.com/2026/fecd7d21-9997-d213-7d3b-997594ce9e82.htm

---

| Rebar Shape Terminations Data Methods |
| --- |

The RebarShapeTerminationsData type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetDocument | Gets the document containing the end treatment ids. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

RebarShapeTerminationsData Class Autodesk.Revit.DB.Structure Namespace